package ru.javarush.java.core.level48.task06;
/*
Чистка волшебного свитка удачи 🧙‍♂️
Представьте, что вы могущественный волшебник, готовящий свиток с "чистыми" числами удачи для своих учеников. Изначально на свитке были написаны числа от 1 до 5. Однако, как это часто бывает, злые духи подшутили и добавили туда "нечистые" числа — все чётные! Эти числа приносят только беду и должны быть немедленно удалены из свитка.

Возьмите ваш список целых чисел. Используя мощное заклинание removeIf и специальное лямбда-выражение, которое определяет "чистоту" числа (то есть, является ли оно нечётным), очистите свиток от всех вредоносных чётных чисел. Как только очищение будет завершено, покажите миру ваш итоговый, абсолютно чистый и полный удачи свиток, выведя его содержимое на экран.

Требования:
•	В задаче должен использоваться метод removeIf для удаления элементов из списка.
•	В removeIf должно быть передано лямбда-выражение для определения, какие элементы удалить.
•	Лямбда-выражение должно определять, что чётные числа являются "нечистыми" и подлежат удалению из списка.
•	Задача должна выполняться на списке целых чисел, содержащем значения от 1 до 5.
•	После удаления всех чётных чисел итоговый список должен быть выведен на экран.

import java.util.ArrayList;
import java.util.List;

public class Solution {
    public static void main(String[] args) {
        // Формируем "свиток" с числами от 1 до 5
        List<Integer> scroll = new ArrayList<>();
        for (int i = 1; i <= 5; i++) {
            scroll.add(i);
        }

        // Очищаем свиток


        // Выводим итоговый "чистый" свиток

    }
}

 */
import java.util.ArrayList;
import java.util.List;

public class Solution {

    static int base = 100; //Пример из следующей лекции
    public static void main(String[] args) {
        // Формируем "свиток" с числами от 1 до 5
        List<Integer> scroll = new ArrayList<>();
        for (int i = 1; i <= 5; i++) {
            scroll.add(i);
        }

        // Очищаем свиток
        scroll.removeIf(s -> s % 2 == 0);


        // Выводим итоговый "чистый" свиток
        System.out.println(scroll);

//Пример из следующей лекции
            Runnable printer = () -> System.out.println(base);
            printer.run();   // 100
            base = 200;
            printer.run();   // 200  ← читает поле каждый раз
        //Пример из следующей лекции


    }
}
/*
package ru.javarush.java.core.level48.task06;

import java.util.ArrayList;
import java.util.List;

public class Solution {
    public static void main(String[] args) {
        // Формируем "свиток" с числами от 1 до 5
        List<Integer> scroll = new ArrayList<>();
        for (int i = 1; i <= 5; i++) {
            scroll.add(i);
        }

        // Очищаем свиток
        scroll.removeIf(n -> n % 2 == 0);

        // Выводим итоговый "чистый" свиток
        System.out.println(scroll); // Ожидаемый результат: [1, 3, 5]
    }
}
 */