package ru.javarush.java.core.level14.task01;
/*
Новый компаньон для вашего виртуального мира

Представьте, что вы создаёте свою первую виртуальную семью домашних питомцев, и в неё обязательно должен войти верный пёс. Сейчас вам нужно создать базовый шаблон, или «чертёж», для всех будущих собак.

Этот шаблон пока не будет содержать никаких уникальных особенностей или способностей, это просто «чистый лист» для будущих четвероногих друзей.

Ваша задача — объявить этот новый шаблон, назвав его Dog, и пока оставить его совершенно пустым.

Требования:
•	В программе должен быть объявлен новый класс с именем Dog.
•	Класс Dog должен быть объявлен с использованием ключевого слова class.
•	Класс Dog не должен содержать никаких полей, методов или конструкторов — его тело должно быть пустым.
 */
// Основной класс с точкой входа в программу
public class Solution {
    public static void main(String[] args) {

        
    }
}

// Шаблон (чертёж) для создания объектов-котов
class Dog {

}